cement<-data.frame(
  X1=c( 7, 1, 11, 11, 7, 11, 3, 1, 2, 21, 1, 11, 10),
  X2=c(26, 29, 56, 31, 52, 55, 71, 31, 54, 47, 40, 66, 68),
  X3=c( 6, 15, 8, 8, 6, 9, 17, 22, 18, 4, 23, 9, 8),
  X4=c(60, 52, 20, 47, 33, 22, 6, 44, 22, 26, 34, 12, 12),
  Y =c(78.5, 74.3, 104.3, 87.6, 95.9, 109.2, 102.7, 72.5,
       93.1,115.9, 83.8, 113.3, 109.4)
)

lm.sol<-lm(Y ~ X1+X2+X3+X4, data=cement)
summary(lm.sol)

#最优结果
lm.opt<-lm(Y ~ X1+X2, data=cement)
summary(lm.opt)

XX<-cor(cement[1:4])
kappa(XX,exact=TRUE)
#得到1376.881〉1000， 认为存在严重的多重共线性
eigen(XX)
#取最小的value, 得到的系数(0.2410522, 0.6417561, 0.2684661, 0.676734)
#（0.2410522, 0.6417561）和（0.2684661, 0.676734）存在线性相关，认为step()中去掉的变量（X3, X4）是合理的。如果
#如果采用X3, X4也能取得不错的线性回归公式
lm.opt<-lm(Y ~ X3+X4, data=cement)
summary(lm.opt)